## DataFrame
The combination of series is known as Dataframe.

In [3]:
import numpy as np
import pandas as pd

In [4]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}
df = pd.DataFrame(data)
print(df)

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [5]:
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
df2 = pd.DataFrame(data_list)
columns = ["Name","Age","City","Salary"]
df2 = pd.DataFrame(data_list,columns=columns)
print(df2)

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

Selction and indexing of columns

In [6]:
print(df2)

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [7]:
# If i want to print the column of Name 
print(df2['Name'])

# If i want to print the multiple columns 
print(f"\n{df2[['Name','City']]}")

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

    Name      City
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

Creating a new column

In [8]:
df2['Designation'] = ["Doctor","Engg",'Doctor',"Engg"]
print(df2)

    Name  Age      City  Salary Designation
0   John   28  New York   65000      Doctor
1   Anna   34     Paris   70000        Engg
2  Peter   29    Berlin   62000      Doctor
3  Linda   42    London   85000        Engg

Removing Columns

In [9]:
# For removing columns we use drop() method.
# print(df2.drop('Designation',axis=1))# it gives a copy but it nor remove it permanently 

# For removing it permanently we use below method
df2.drop('Designation',axis=1,inplace=True)

In [10]:
# It get removes permanently.
print(df2)

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

Selecting rows

In [11]:
print(df2)

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [12]:
## For selecting the rows we use below syntax
print(df2.loc[0])

## For selecting multiple rows
print(f"\n{df2.loc[[0,3]]}")

# For selecting by index value we use iloc[]
print(f"\n{df2.iloc[2]}")

Name          John
Age             28
City      New York
Salary       65000
Name: 0, dtype: object

    Name  Age      City  Salary
0   John   28  New York   65000
3  Linda   42    London   85000

Name       Peter
Age           29
City      Berlin
Salary     62000
Name: 2, dtype: object

Selecting the subset of rows and columns

In [13]:
print(df2.loc[[0,1]][["City","Salary"]])

       City  Salary
0  New York   65000
1     Paris   70000

In [18]:
print(df2)

df2.loc[[2,3]][["Name","Age"]]

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

    Name  Age
2  Peter   29
3  Linda   42

Conditional Selection

In [15]:
## Checking for those who's age is greater than 30
df2[df2["Age"] > 30]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [16]:
# Selecting who's age is greater than 30 and they should be from paris

df2[df2["Age"] > 30]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [17]:
## In this we use and operator as ' &' and for or ' | '

df2[(df2['Age'] > 30) & (df2['City'] == "Paris")]

df2[(df2['Age'] > 30) & (df2['Salary'] > 70000)]

    Name  Age    City  Salary
3  Linda   42  London   85000